export var defaultLangPerScript = {
  "latin": "en",
  "greek": "el",
  "cyrillic": "ru"
}

export var languageNames = {
  "latin": {
    "af": "Afrikaans",
    "ca": "Catalan",
    "cs": "Czech",
    "da": "Danish",
    "en": "English",
    "es": "Spanish",
    "et": "Estonian",
    "eu": "Basque",
    "fi": "Finnish",
    "fr": "French",
    "gl": "Galician",
    "hr": "Croatian",
    "hu": "Hungarian",
    "is": "Icelandic",
    "it": "Italian",
    "lt": "Lithuanian",
    "lv": "Latvian",
    "nl": "Dutch",
    "no": "Norwegian",
    "pl": "Polish",
    "pt": "Portuguese",
    "ro": "Romanian",
    "sk": "Slovak",
    "sl": "Slovenian",
    "tl": "Tagalog",
    "tr": "Turkish"
  },
  "cyrillic": {
    "bg": "Bulgarian",
    "ru": "Russian",
    "sr": "Serbian",
    "uk": "Ukranian"

  },
  "greek": {
    "el": "Greek"
  }
}

/* Determined by rigorous linguistic analysis and totally not by
   dodgy heuristics. */
export var alphabets = {
    "latin": "abcdefghijklmnopqrstuvwxyz",
  "latin_extended": 'abcdefghijklmnopqrstuvwxyzàáăâäāąåǻãæćčçĉċďđðèéĕěêëėēęğĝġħĥìíĭîïi̇įĩĵķłĺľļńňņñòóŏôõöőōøœŕřŗśšşŝșťțþùúŭûüűūųůũẃŵẅẁýŷÿỳźžż',
  "cyrillic": "абвгдеёжзийклмнопрстуфхцчшщъыьэюя",
  "cyrillic_extended": "абвгдеёжзийклмнопрстуфхцчшщъыьэюяґђѓєѕіїјљњћќўџ",
  "greek": "αβγδεζηθικλμνξοπρσςτυφχψω",
"af": ["a","b","c","d","e","ê","ë","f","g","h","i","j","k","l","m","n","o","p","r","s","t","u","v","w","x","y","z"],
"bg": ["а","б","в","г","д","е","ж","з","и","й","к","л","м","н","о","п","р","с","т","у","ф","х","ц","ч","ш","щ","ъ","ь","ю","я"],
"ca": ["a","à","b","c","ç","d","e","é","è","f","g","h","i","í","ï","j","k","l","m","n","o","ó","ò","p","q","r","s","t","u","ú","v","w","x","y","z"],
"cs": ["a","á","b","c","č","d","ď","e","é","ě","f","g","h","i","í","j","k","l","m","n","ň","o","p","r","ř","s","š","t","ť","u","ú","ů","v","w","x","y","ý","z","ž"],
"da": ["a","å","æ","b","c","d","e","f","g","h","i","j","k","l","m","n","o","ø","p","r","s","t","u","v","w","x","y","z"],
"de": ["a","ä","b","c","d","e","f","g","h","i","j","k","l","m","n","o","ö","p","r","s","ß","t","u","ü","v","w","x","y","z"],
"el": ["α","ά","β","γ","δ","ε","έ","ζ","η","ή","θ","ι","ί","κ","λ","μ","ν","ξ","ο","ό","π","ρ","σ","ς","τ","υ","ύ","φ","χ","ψ","ω","ώ"],
"en": ["a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z"],
"es": ["a","á","b","c","d","e","é","f","g","h","i","í","j","k","l","m","n","ñ","o","ó","p","q","r","s","t","u","ú","v","w","x","y","z"],
"et": ["a","ä","b","c","d","e","f","g","h","i","j","k","l","m","n","o","ö","õ","p","r","s","t","u","ü","v","w","y"],
"eu": ["a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","r","s","t","u","v","w","x","y","z"],
"fi": ["a","ä","b","c","d","e","f","g","h","i","j","k","l","m","n","o","ö","p","r","s","t","u","v","w","y"],
"fr": ["a","à","â","b","c","ç","d","e","é","è","ê","f","g","h","i","î","j","k","l","m","n","o","ô","p","q","r","s","t","u","û","v","w","x","y","z"],
"gl": ["a","á","b","c","d","e","é","f","g","h","i","í","j","k","l","m","n","ñ","o","ó","p","q","r","s","t","u","ú","v","w","x","y","z"],
"hr": ["a","b","c","ć","č","d","đ","e","f","g","h","i","j","k","l","m","n","o","p","r","s","š","t","u","v","w","y","z","ž"],
"hu": ["a","á","b","c","d","e","é","f","g","h","i","í","j","k","l","m","n","o","ó","ö","ő","p","r","s","t","u","ú","ü","ű","v","w","y","z"],
"is": ["a","á","æ","b","c","d","đ","ð","e","é","f","g","h","i","í","j","k","ķ","l","m","n","o","ó","ö","p","r","s","t","u","ú","ũ","ū","v","w","x","y","ý","þ"],
"it": ["a","à","b","c","d","e","f","g","h","i","j","k","l","m","n","o","ò","p","q","r","s","t","u","v","w","y","z"],
"lt": ["a","ą","b","c","č","d","e","ė","ę","f","g","h","i","į","j","k","l","m","n","o","p","r","s","š","t","u","ų","ū","v","y","z","ž"],
"lv": ["a","ā","b","c","č","d","e","ē","f","g","ģ","h","i","ī","j","k","ķ","l","ļ","m","n","ņ","o","p","r","s","š","t","u","ū","v","z","ž"],
"nl": ["a","b","c","d","e","ë","f","g","h","i","j","k","l","m","n","o","p","r","s","t","u","v","w","x","y","z"],
"no": ["a","å","æ","b","c","d","e","f","g","h","i","j","k","l","m","n","o","ø","p","r","s","t","u","v","w","y"],
"pl": ["a","ą","b","c","ć","d","e","ę","f","g","h","i","j","k","l","ł","m","n","ń","o","ó","p","r","s","ś","t","u","v","w","y","z","ź","ż"],
"pt": ["a","á","â","ã","b","c","ç","d","e","é","ê","f","g","h","i","í","j","k","l","m","n","o","ó","õ","p","q","r","s","t","u","ú","v","w","x","y","z"],
"ro": ["a","ă","â","b","c","d","e","f","g","h","i","î","j","k","l","m","n","o","p","r","s","ş","ș","t","ţ","ț","u","v","w","x","y","z"],
"ru": ["а","б","в","г","д","е","ё","ж","з","и","й","к","л","м","н","о","п","р","с","т","у","ф","х","ц","ч","ш","щ","ъ","ы","ь","э","ю","я"],
"sk": ["a","á","ä","b","c","č","d","ď","e","é","f","g","h","i","í","j","k","l","ľ","m","n","ň","o","ó","ô","p","r","s","š","t","ť","u","ú","v","w","x","y","ý","z","ž"],
"sl": ["a","b","c","č","d","e","f","g","h","i","j","k","l","m","n","o","p","r","s","š","t","u","v","w","y","z","ž"],
"sr": ["a","b","c","ć","č","d","đ","e","f","g","h","i","j","k","l","m","n","o","p","r","s","š","t","u","v","y","z","ž","а","б","в","г","д","е","ж","з","и","ј","к","л","м","н","о","п","р","с","т","ћ","у","х","ш"],
"sv": ["a","å","ä","b","c","d","e","f","g","h","i","j","k","l","m","n","o","ö","p","r","s","t","u","v","w","x","y"],
"tl": ["a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z"],
"tr": ["a","b","c","ç","d","e","f","g","ğ","h","i","ı","j","k","l","m","n","o","ö","p","r","s","ş","t","u","ü","v","w","y","z"],
"uk": ["a","b","c","d","e","f","g","h","i","k","l","m","n","o","p","r","s","t","u","v","w","y","а","б","в","г","д","е","ё","є","ж","з","и","і","ї","й","к","л","м","н","о","п","р","с","т","у","ф","х","ц","ч","ш","щ","ы","ь","э","ю","я"],
}
